FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_evsys.h
/**
 * \file
 *
 * \brief Component description for EVSYS
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMD20_EVSYS_COMPONENT_
#define _SAMD20_EVSYS_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR EVSYS */
/* ========================================================================== */
/** \addtogroup SAMD20_EVSYS Event System Interface */
/*@{*/

#define REV_EVSYS    0x100

/* -------- EVSYS_CTRL : (EVSYS Offset: 0x00) ( /W  8) Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t SWRST : 1;   /*!< bit:      0  Software Reset                     */
            uint8_t  : 3;        /*!< bit:  1.. 3  Reserved                           */
            uint8_t GCLKREQ : 1; /*!< bit:      4  Generic Clock Request              */
            uint8_t  : 3;        /*!< bit:  5.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } EVSYS_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EVSYS_CTRL_OFFSET         0x00           /**< \brief (EVSYS_CTRL offset) Control Register */
#define EVSYS_CTRL_RESETVALUE     0x00           /**< \brief (EVSYS_CTRL reset_value) Control Register */

#define EVSYS_CTRL_SWRST_Pos      0              /**< \brief (EVSYS_CTRL) Software Reset */
#define EVSYS_CTRL_SWRST          ( 0x1u << EVSYS_CTRL_SWRST_Pos )
#define EVSYS_CTRL_GCLKREQ_Pos    4              /**< \brief (EVSYS_CTRL) Generic Clock Request */
#define EVSYS_CTRL_GCLKREQ        ( 0x1u << EVSYS_CTRL_GCLKREQ_Pos )
#define EVSYS_CTRL_MASK           0x11u          /**< \brief (EVSYS_CTRL) MASK Register */

/* -------- EVSYS_CHANNEL : (EVSYS Offset: 0x04) (R/W 32) Channel Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t CHANNEL : 8; /*!< bit:  0.. 7  Channel Selection                  */
            uint32_t SWEVT : 1;   /*!< bit:      8  Software Event                     */
            uint32_t : 7;         /*!< bit:  9..15  Reserved                           */
            uint32_t EVGEN : 8;   /*!< bit: 16..23  Event Generator Selection          */
            uint32_t PATH : 2;    /*!< bit: 24..25  Path Selection                     */
            uint32_t EDGSEL : 2;  /*!< bit: 26..27  Edge Selection                     */
            uint32_t : 4;         /*!< bit: 28..31  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } EVSYS_CHANNEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EVSYS_CHANNEL_OFFSET                    0x04       /**< \brief (EVSYS_CHANNEL offset) Channel Register */
#define EVSYS_CHANNEL_RESETVALUE                0x00000000 /**< \brief (EVSYS_CHANNEL reset_value) Channel Register */

#define EVSYS_CHANNEL_CHANNEL_Pos               0          /**< \brief (EVSYS_CHANNEL) Channel Selection */
#define EVSYS_CHANNEL_CHANNEL_Msk               ( 0xFFu << EVSYS_CHANNEL_CHANNEL_Pos )
#define EVSYS_CHANNEL_CHANNEL( value )    ( ( EVSYS_CHANNEL_CHANNEL_Msk & ( ( value ) << EVSYS_CHANNEL_CHANNEL_Pos ) ) )
#define EVSYS_CHANNEL_SWEVT_Pos                 8  /**< \brief (EVSYS_CHANNEL) Software Event */
#define EVSYS_CHANNEL_SWEVT                     ( 0x1u << EVSYS_CHANNEL_SWEVT_Pos )
#define EVSYS_CHANNEL_EVGEN_Pos                 16 /**< \brief (EVSYS_CHANNEL) Event Generator Selection */
#define EVSYS_CHANNEL_EVGEN_Msk                 ( 0xFFu << EVSYS_CHANNEL_EVGEN_Pos )
#define EVSYS_CHANNEL_EVGEN( value )    ( ( EVSYS_CHANNEL_EVGEN_Msk & ( ( value ) << EVSYS_CHANNEL_EVGEN_Pos ) ) )
#define EVSYS_CHANNEL_PATH_Pos                  24 /**< \brief (EVSYS_CHANNEL) Path Selection */
#define EVSYS_CHANNEL_PATH_Msk                  ( 0x3u << EVSYS_CHANNEL_PATH_Pos )
#define EVSYS_CHANNEL_PATH( value )     ( ( EVSYS_CHANNEL_PATH_Msk & ( ( value ) << EVSYS_CHANNEL_PATH_Pos ) ) )
#define   EVSYS_CHANNEL_PATH_SYNCHRONOUS        ( 0x0u << 24 ) /**< \brief (EVSYS_CHANNEL) Synchronous path */
#define   EVSYS_CHANNEL_PATH_RESYNCHRONIZED     ( 0x1u << 24 ) /**< \brief (EVSYS_CHANNEL) Resynchronized path */
#define   EVSYS_CHANNEL_PATH_ASYNCHRONOUS       ( 0x2u << 24 ) /**< \brief (EVSYS_CHANNEL) Asynchronous path */
#define EVSYS_CHANNEL_EDGSEL_Pos                26             /**< \brief (EVSYS_CHANNEL) Edge Selection */
#define EVSYS_CHANNEL_EDGSEL_Msk                ( 0x3u << EVSYS_CHANNEL_EDGSEL_Pos )
#define EVSYS_CHANNEL_EDGSEL( value )    ( ( EVSYS_CHANNEL_EDGSEL_Msk & ( ( value ) << EVSYS_CHANNEL_EDGSEL_Pos ) ) )
#define   EVSYS_CHANNEL_EDGSEL_NO_EVT_OUTPUT    ( 0x0u << 26 ) /**< \brief (EVSYS_CHANNEL) No Event Output */
#define   EVSYS_CHANNEL_EDGSEL_RISING_EDGE      ( 0x1u << 26 ) /**< \brief (EVSYS_CHANNEL) Event detection on the rising edge */
#define   EVSYS_CHANNEL_EDGSEL_FALLING_EDGE     ( 0x2u << 26 ) /**< \brief (EVSYS_CHANNEL) Event detection on the falling edge */
#define   EVSYS_CHANNEL_EDGSEL_BOTH_EDGE        ( 0x3u << 26 ) /**< \brief (EVSYS_CHANNEL) Event detection on both rising/falling edge */
#define EVSYS_CHANNEL_MASK                      0x0FFF01FFu    /**< \brief (EVSYS_CHANNEL) MASK Register */

/* -------- EVSYS_USER : (EVSYS Offset: 0x08) (R/W 16) User Mux Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t USER : 8;    /*!< bit:  0.. 7  User Mux Selection                 */
            uint16_t CHANNEL : 8; /*!< bit:  8..15  Channel Event Selection            */
        } bit;                    /*!< Structure used for bit  access                  */
        uint16_t reg;             /*!< Type      used for register access              */
    } EVSYS_USER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EVSYS_USER_OFFSET         0x08           /**< \brief (EVSYS_USER offset) User Mux Register */
#define EVSYS_USER_RESETVALUE     0x0000         /**< \brief (EVSYS_USER reset_value) User Mux Register */

#define EVSYS_USER_USER_Pos       0              /**< \brief (EVSYS_USER) User Mux Selection */
#define EVSYS_USER_USER_Msk       ( 0xFFu << EVSYS_USER_USER_Pos )
#define EVSYS_USER_USER( value )       ( ( EVSYS_USER_USER_Msk & ( ( value ) << EVSYS_USER_USER_Pos ) ) )
#define EVSYS_USER_CHANNEL_Pos    8              /**< \brief (EVSYS_USER) Channel Event Selection */
#define EVSYS_USER_CHANNEL_Msk    ( 0xFFu << EVSYS_USER_CHANNEL_Pos )
#define EVSYS_USER_CHANNEL( value )    ( ( EVSYS_USER_CHANNEL_Msk & ( ( value ) << EVSYS_USER_CHANNEL_Pos ) ) )
#define EVSYS_USER_MASK           0xFFFFu        /**< \brief (EVSYS_USER) MASK Register */

/* -------- EVSYS_CHSTATUS : (EVSYS Offset: 0x0C) (R/  32) Channel Status Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t USRRDY0 : 8; /*!< bit:  0.. 7  User Ready for Channels 0 to 7 (modulo 16) */
            uint32_t CHBUSY0 : 8; /*!< bit:  8..15  Channels Busy 0 to 7 (modulo 16)   */
            uint32_t USRRDY1 : 8; /*!< bit: 16..23  User Ready for Channels 8 to 15 (modulo 16) */
            uint32_t CHBUSY1 : 8; /*!< bit: 24..31  Channels Busy 8 to 15 (modulo 16)  */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } EVSYS_CHSTATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

