FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_evsys.h
#define EVSYS_CHSTATUS_OFFSET                0x0C       /**< \brief (EVSYS_CHSTATUS offset) Channel Status Register */
#define EVSYS_CHSTATUS_RESETVALUE            0x00000000 /**< \brief (EVSYS_CHSTATUS reset_value) Channel Status Register */

#define EVSYS_CHSTATUS_USRRDY0_Pos           0          /**< \brief (EVSYS_CHSTATUS) User Ready for Channels 0 to 7 (modulo 16) */
#define EVSYS_CHSTATUS_USRRDY0_Msk           ( 0xFFu << EVSYS_CHSTATUS_USRRDY0_Pos )
#define EVSYS_CHSTATUS_USRRDY0( value )    ( ( EVSYS_CHSTATUS_USRRDY0_Msk & ( ( value ) << EVSYS_CHSTATUS_USRRDY0_Pos ) ) )
#define   EVSYS_CHSTATUS_USRRDY0_USRRDY0     ( 0x1u << 0 )  /**< \brief (EVSYS_CHSTATUS) User ready for Channel 0 */
#define   EVSYS_CHSTATUS_USRRDY0_USRRDY1     ( 0x2u << 0 )  /**< \brief (EVSYS_CHSTATUS) User ready for Channel 1 */
#define   EVSYS_CHSTATUS_USRRDY0_USRRDY2     ( 0x4u << 0 )  /**< \brief (EVSYS_CHSTATUS) User ready for Channel 2 */
#define   EVSYS_CHSTATUS_USRRDY0_USRRDY3     ( 0x8u << 0 )  /**< \brief (EVSYS_CHSTATUS) User ready for Channel 3 */
#define   EVSYS_CHSTATUS_USRRDY0_USRRDY4     ( 0x10u << 0 ) /**< \brief (EVSYS_CHSTATUS) User ready for Channel 4 */
#define   EVSYS_CHSTATUS_USRRDY0_USRRDY5     ( 0x20u << 0 ) /**< \brief (EVSYS_CHSTATUS) User ready for Channel 5 */
#define   EVSYS_CHSTATUS_USRRDY0_USRRDY6     ( 0x40u << 0 ) /**< \brief (EVSYS_CHSTATUS) User ready for Channel 6 */
#define   EVSYS_CHSTATUS_USRRDY0_USRRDY7     ( 0x80u << 0 ) /**< \brief (EVSYS_CHSTATUS) User ready for Channel 7 */
#define EVSYS_CHSTATUS_CHBUSY0_Pos           8              /**< \brief (EVSYS_CHSTATUS) Channels Busy 0 to 7 (modulo 16) */
#define EVSYS_CHSTATUS_CHBUSY0_Msk           ( 0xFFu << EVSYS_CHSTATUS_CHBUSY0_Pos )
#define EVSYS_CHSTATUS_CHBUSY0( value )    ( ( EVSYS_CHSTATUS_CHBUSY0_Msk & ( ( value ) << EVSYS_CHSTATUS_CHBUSY0_Pos ) ) )
#define   EVSYS_CHSTATUS_CHBUSY0_CHBUSY0     ( 0x1u << 8 )  /**< \brief (EVSYS_CHSTATUS) Channel 0 busy */
#define   EVSYS_CHSTATUS_CHBUSY0_CHBUSY1     ( 0x2u << 8 )  /**< \brief (EVSYS_CHSTATUS) Channel 1 busy */
#define   EVSYS_CHSTATUS_CHBUSY0_CHBUSY2     ( 0x4u << 8 )  /**< \brief (EVSYS_CHSTATUS) Channel 2 busy */
#define   EVSYS_CHSTATUS_CHBUSY0_CHBUSY3     ( 0x8u << 8 )  /**< \brief (EVSYS_CHSTATUS) Channel 3 busy */
#define   EVSYS_CHSTATUS_CHBUSY0_CHBUSY4     ( 0x10u << 8 ) /**< \brief (EVSYS_CHSTATUS) Channel 4 busy */
#define   EVSYS_CHSTATUS_CHBUSY0_CHBUSY5     ( 0x20u << 8 ) /**< \brief (EVSYS_CHSTATUS) Channel 5 busy */
#define   EVSYS_CHSTATUS_CHBUSY0_CHBUSY6     ( 0x40u << 8 ) /**< \brief (EVSYS_CHSTATUS) Channel 6 busy */
#define   EVSYS_CHSTATUS_CHBUSY0_CHBUSY7     ( 0x80u << 8 ) /**< \brief (EVSYS_CHSTATUS) Channel 7 busy */
#define EVSYS_CHSTATUS_USRRDY1_Pos           16             /**< \brief (EVSYS_CHSTATUS) User Ready for Channels 8 to 15 (modulo 16) */
#define EVSYS_CHSTATUS_USRRDY1_Msk           ( 0xFFu << EVSYS_CHSTATUS_USRRDY1_Pos )
#define EVSYS_CHSTATUS_USRRDY1( value )    ( ( EVSYS_CHSTATUS_USRRDY1_Msk & ( ( value ) << EVSYS_CHSTATUS_USRRDY1_Pos ) ) )
#define   EVSYS_CHSTATUS_USRRDY1_USRRDY8     ( 0x1u << 16 )  /**< \brief (EVSYS_CHSTATUS) User ready for Channel 8 */
#define   EVSYS_CHSTATUS_USRRDY1_USRRDY9     ( 0x2u << 16 )  /**< \brief (EVSYS_CHSTATUS) User ready for Channel 9 */
#define   EVSYS_CHSTATUS_USRRDY1_USRRDY10    ( 0x4u << 16 )  /**< \brief (EVSYS_CHSTATUS) User ready for Channel 10 */
#define   EVSYS_CHSTATUS_USRRDY1_USRRDY11    ( 0x8u << 16 )  /**< \brief (EVSYS_CHSTATUS) User ready for Channel 11 */
#define   EVSYS_CHSTATUS_USRRDY1_USRRDY12    ( 0x10u << 16 ) /**< \brief (EVSYS_CHSTATUS) User ready for Channel 12 */
#define   EVSYS_CHSTATUS_USRRDY1_USRRDY13    ( 0x20u << 16 ) /**< \brief (EVSYS_CHSTATUS) User ready for Channel 13 */
#define   EVSYS_CHSTATUS_USRRDY1_USRRDY14    ( 0x40u << 16 ) /**< \brief (EVSYS_CHSTATUS) User ready for Channel 14 */
#define   EVSYS_CHSTATUS_USRRDY1_USRRDY15    ( 0x80u << 16 ) /**< \brief (EVSYS_CHSTATUS) User ready for Channel 15 */
#define EVSYS_CHSTATUS_CHBUSY1_Pos           24              /**< \brief (EVSYS_CHSTATUS) Channels Busy 8 to 15 (modulo 16) */
#define EVSYS_CHSTATUS_CHBUSY1_Msk           ( 0xFFu << EVSYS_CHSTATUS_CHBUSY1_Pos )
#define EVSYS_CHSTATUS_CHBUSY1( value )    ( ( EVSYS_CHSTATUS_CHBUSY1_Msk & ( ( value ) << EVSYS_CHSTATUS_CHBUSY1_Pos ) ) )
#define   EVSYS_CHSTATUS_CHBUSY1_CHBUSY8     ( 0x1u << 24 )  /**< \brief (EVSYS_CHSTATUS) Channel 8 busy */
#define   EVSYS_CHSTATUS_CHBUSY1_CHBUSY9     ( 0x2u << 24 )  /**< \brief (EVSYS_CHSTATUS) Channel 9 busy */
#define   EVSYS_CHSTATUS_CHBUSY1_CHBUSY10    ( 0x4u << 24 )  /**< \brief (EVSYS_CHSTATUS) Channel 10 busy */
#define   EVSYS_CHSTATUS_CHBUSY1_CHBUSY11    ( 0x8u << 24 )  /**< \brief (EVSYS_CHSTATUS) Channel 11 busy */
#define   EVSYS_CHSTATUS_CHBUSY1_CHBUSY12    ( 0x10u << 24 ) /**< \brief (EVSYS_CHSTATUS) Channel 12 busy */
#define   EVSYS_CHSTATUS_CHBUSY1_CHBUSY13    ( 0x20u << 24 ) /**< \brief (EVSYS_CHSTATUS) Channel 13 busy */
#define   EVSYS_CHSTATUS_CHBUSY1_CHBUSY14    ( 0x40u << 24 ) /**< \brief (EVSYS_CHSTATUS) Channel 14 busy */
#define   EVSYS_CHSTATUS_CHBUSY1_CHBUSY15    ( 0x80u << 24 ) /**< \brief (EVSYS_CHSTATUS) Channel 15 busy */
#define EVSYS_CHSTATUS_MASK                  0xFFFFFFFFu     /**< \brief (EVSYS_CHSTATUS) MASK Register */

/* -------- EVSYS_INTENCLR : (EVSYS Offset: 0x10) (R/W 32) Interrupt Enable Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t OVR0 : 8; /*!< bit:  0.. 7  Overrun Interrupt Disable for Channels 0 to 7 (modulo 16) */
            uint32_t EVD0 : 8; /*!< bit:  8..15  Event Detection Interrupt Disable for Channels 0 to 7 (modulo 16) */
            uint32_t OVR1 : 8; /*!< bit: 16..23  Overrun Interrupt Disable for Channels 8 to 15 (modulo 16) */
            uint32_t EVD1 : 8; /*!< bit: 24..31  Event Detection Interrupt Disable for Channels 8 to 15 (modulo 16) */
        } bit;                 /*!< Structure used for bit  access                  */
        uint32_t reg;          /*!< Type      used for register access              */
    } EVSYS_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EVSYS_INTENCLR_OFFSET          0x10       /**< \brief (EVSYS_INTENCLR offset) Interrupt Enable Clear Register */
#define EVSYS_INTENCLR_RESETVALUE      0x00000000 /**< \brief (EVSYS_INTENCLR reset_value) Interrupt Enable Clear Register */

