FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_evsys.h
#define EVSYS_INTENCLR_OVR0_Pos        0          /**< \brief (EVSYS_INTENCLR) Overrun Interrupt Disable for Channels 0 to 7 (modulo 16) */
#define EVSYS_INTENCLR_OVR0_Msk        ( 0xFFu << EVSYS_INTENCLR_OVR0_Pos )
#define EVSYS_INTENCLR_OVR0( value )    ( ( EVSYS_INTENCLR_OVR0_Msk & ( ( value ) << EVSYS_INTENCLR_OVR0_Pos ) ) )
#define   EVSYS_INTENCLR_OVR0_OVR0     ( 0x1u << 0 )  /**< \brief (EVSYS_INTENCLR) Overrun detected on Channel 0 */
#define   EVSYS_INTENCLR_OVR0_OVR1     ( 0x2u << 0 )  /**< \brief (EVSYS_INTENCLR) Overrun detected on Channel 1 */
#define   EVSYS_INTENCLR_OVR0_OVR2     ( 0x4u << 0 )  /**< \brief (EVSYS_INTENCLR) Overrun detected on Channel 2 */
#define   EVSYS_INTENCLR_OVR0_OVR3     ( 0x8u << 0 )  /**< \brief (EVSYS_INTENCLR) Overrun detected on Channel 3 */
#define   EVSYS_INTENCLR_OVR0_OVR4     ( 0x10u << 0 ) /**< \brief (EVSYS_INTENCLR) Overrun detected on Channel 4 */
#define   EVSYS_INTENCLR_OVR0_OVR5     ( 0x20u << 0 ) /**< \brief (EVSYS_INTENCLR) Overrun detected on Channel 5 */
#define   EVSYS_INTENCLR_OVR0_OVR6     ( 0x40u << 0 ) /**< \brief (EVSYS_INTENCLR) Overrun detected on Channel 6 */
#define   EVSYS_INTENCLR_OVR0_OVR7     ( 0x80u << 0 ) /**< \brief (EVSYS_INTENCLR) Overrun detected on Channel 7 */
#define EVSYS_INTENCLR_EVD0_Pos        8              /**< \brief (EVSYS_INTENCLR) Event Detection Interrupt Disable for Channels 0 to 7 (modulo 16) */
#define EVSYS_INTENCLR_EVD0_Msk        ( 0xFFu << EVSYS_INTENCLR_EVD0_Pos )
#define EVSYS_INTENCLR_EVD0( value )    ( ( EVSYS_INTENCLR_EVD0_Msk & ( ( value ) << EVSYS_INTENCLR_EVD0_Pos ) ) )
#define   EVSYS_INTENCLR_EVD0_EVD0     ( 0x1u << 8 )  /**< \brief (EVSYS_INTENCLR) Event detected on Channel 0 */
#define   EVSYS_INTENCLR_EVD0_EVD1     ( 0x2u << 8 )  /**< \brief (EVSYS_INTENCLR) Event detected on Channel 1 */
#define   EVSYS_INTENCLR_EVD0_EVD2     ( 0x4u << 8 )  /**< \brief (EVSYS_INTENCLR) Event detected on Channel 2 */
#define   EVSYS_INTENCLR_EVD0_EVD3     ( 0x8u << 8 )  /**< \brief (EVSYS_INTENCLR) Event detected on Channel 3 */
#define   EVSYS_INTENCLR_EVD0_EVD4     ( 0x10u << 8 ) /**< \brief (EVSYS_INTENCLR) Event detected on Channel 4 */
#define   EVSYS_INTENCLR_EVD0_EVD5     ( 0x20u << 8 ) /**< \brief (EVSYS_INTENCLR) Event detected on Channel 5 */
#define   EVSYS_INTENCLR_EVD0_EVD6     ( 0x40u << 8 ) /**< \brief (EVSYS_INTENCLR) Event detected on Channel 6 */
#define   EVSYS_INTENCLR_EVD0_EVD7     ( 0x80u << 8 ) /**< \brief (EVSYS_INTENCLR) Event detected on Channel 7 */
#define EVSYS_INTENCLR_OVR1_Pos        16             /**< \brief (EVSYS_INTENCLR) Overrun Interrupt Disable for Channels 8 to 15 (modulo 16) */
#define EVSYS_INTENCLR_OVR1_Msk        ( 0xFFu << EVSYS_INTENCLR_OVR1_Pos )
#define EVSYS_INTENCLR_OVR1( value )    ( ( EVSYS_INTENCLR_OVR1_Msk & ( ( value ) << EVSYS_INTENCLR_OVR1_Pos ) ) )
#define   EVSYS_INTENCLR_OVR1_OVR8     ( 0x1u << 16 )  /**< \brief (EVSYS_INTENCLR) Overrun detected on Channel 8 */
#define   EVSYS_INTENCLR_OVR1_OVR9     ( 0x2u << 16 )  /**< \brief (EVSYS_INTENCLR) Overrun detected on Channel 9 */
#define   EVSYS_INTENCLR_OVR1_OVR10    ( 0x4u << 16 )  /**< \brief (EVSYS_INTENCLR) Overrun detected on Channel 10 */
#define   EVSYS_INTENCLR_OVR1_OVR11    ( 0x8u << 16 )  /**< \brief (EVSYS_INTENCLR) Overrun detected on Channel 11 */
#define   EVSYS_INTENCLR_OVR1_OVR12    ( 0x10u << 16 ) /**< \brief (EVSYS_INTENCLR) Overrun detected on Channel 12 */
#define   EVSYS_INTENCLR_OVR1_OVR13    ( 0x20u << 16 ) /**< \brief (EVSYS_INTENCLR) Overrun detected on Channel 13 */
#define   EVSYS_INTENCLR_OVR1_OVR14    ( 0x40u << 16 ) /**< \brief (EVSYS_INTENCLR) Overrun detected on Channel 14 */
#define   EVSYS_INTENCLR_OVR1_OVR15    ( 0x80u << 16 ) /**< \brief (EVSYS_INTENCLR) Overrun detected on Channel 15 */
#define EVSYS_INTENCLR_EVD1_Pos        24              /**< \brief (EVSYS_INTENCLR) Event Detection Interrupt Disable for Channels 8 to 15 (modulo 16) */
#define EVSYS_INTENCLR_EVD1_Msk        ( 0xFFu << EVSYS_INTENCLR_EVD1_Pos )
#define EVSYS_INTENCLR_EVD1( value )    ( ( EVSYS_INTENCLR_EVD1_Msk & ( ( value ) << EVSYS_INTENCLR_EVD1_Pos ) ) )
#define   EVSYS_INTENCLR_EVD1_EVD8     ( 0x1u << 24 )  /**< \brief (EVSYS_INTENCLR) Event detected on Channel 8 */
#define   EVSYS_INTENCLR_EVD1_EVD9     ( 0x2u << 24 )  /**< \brief (EVSYS_INTENCLR) Event detected on Channel 9 */
#define   EVSYS_INTENCLR_EVD1_EVD10    ( 0x4u << 24 )  /**< \brief (EVSYS_INTENCLR) Event detected on Channel 10 */
#define   EVSYS_INTENCLR_EVD1_EVD11    ( 0x8u << 24 )  /**< \brief (EVSYS_INTENCLR) Event detected on Channel 11 */
#define   EVSYS_INTENCLR_EVD1_EVD12    ( 0x10u << 24 ) /**< \brief (EVSYS_INTENCLR) Event detected on Channel 12 */
#define   EVSYS_INTENCLR_EVD1_EVD13    ( 0x20u << 24 ) /**< \brief (EVSYS_INTENCLR) Event detected on Channel 13 */
#define   EVSYS_INTENCLR_EVD1_EVD14    ( 0x40u << 24 ) /**< \brief (EVSYS_INTENCLR) Event detected on Channel 14 */
#define   EVSYS_INTENCLR_EVD1_EVD15    ( 0x80u << 24 ) /**< \brief (EVSYS_INTENCLR) Event detected on Channel 15 */
#define EVSYS_INTENCLR_MASK            0xFFFFFFFFu     /**< \brief (EVSYS_INTENCLR) MASK Register */

/* -------- EVSYS_INTENSET : (EVSYS Offset: 0x14) (R/W 32) Interrupt Enable Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t OVR0 : 8; /*!< bit:  0.. 7  Overrun Interrupt Enable for Channels 0 to 7 (modulo 16) */
            uint32_t EVD0 : 8; /*!< bit:  8..15  Event Detection Interrupt Enable for Channels 0 to 7 (modulo 16) */
            uint32_t OVR1 : 8; /*!< bit: 16..23  Overrun Interrupt Enable for Channels 8 to 15 (modulo 16) */
            uint32_t EVD1 : 8; /*!< bit: 24..31  Event Detection Interrupt Enable for Channels 8 to 15 (modulo 16) */
        } bit;                 /*!< Structure used for bit  access                  */
        uint32_t reg;          /*!< Type      used for register access              */
    } EVSYS_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EVSYS_INTENSET_OFFSET          0x14       /**< \brief (EVSYS_INTENSET offset) Interrupt Enable Set Register */
#define EVSYS_INTENSET_RESETVALUE      0x00000000 /**< \brief (EVSYS_INTENSET reset_value) Interrupt Enable Set Register */

#define EVSYS_INTENSET_OVR0_Pos        0          /**< \brief (EVSYS_INTENSET) Overrun Interrupt Enable for Channels 0 to 7 (modulo 16) */
#define EVSYS_INTENSET_OVR0_Msk        ( 0xFFu << EVSYS_INTENSET_OVR0_Pos )
#define EVSYS_INTENSET_OVR0( value )    ( ( EVSYS_INTENSET_OVR0_Msk & ( ( value ) << EVSYS_INTENSET_OVR0_Pos ) ) )
#define   EVSYS_INTENSET_OVR0_OVR0     ( 0x1u << 0 )  /**< \brief (EVSYS_INTENSET) Overrun detected on Channel 0 */
#define   EVSYS_INTENSET_OVR0_OVR1     ( 0x2u << 0 )  /**< \brief (EVSYS_INTENSET) Overrun detected on Channel 1 */
#define   EVSYS_INTENSET_OVR0_OVR2     ( 0x4u << 0 )  /**< \brief (EVSYS_INTENSET) Overrun detected on Channel 2 */
#define   EVSYS_INTENSET_OVR0_OVR3     ( 0x8u << 0 )  /**< \brief (EVSYS_INTENSET) Overrun detected on Channel 3 */
#define   EVSYS_INTENSET_OVR0_OVR4     ( 0x10u << 0 ) /**< \brief (EVSYS_INTENSET) Overrun detected on Channel 4 */
#define   EVSYS_INTENSET_OVR0_OVR5     ( 0x20u << 0 ) /**< \brief (EVSYS_INTENSET) Overrun detected on Channel 5 */
#define   EVSYS_INTENSET_OVR0_OVR6     ( 0x40u << 0 ) /**< \brief (EVSYS_INTENSET) Overrun detected on Channel 6 */
#define   EVSYS_INTENSET_OVR0_OVR7     ( 0x80u << 0 ) /**< \brief (EVSYS_INTENSET) Overrun detected on Channel 7 */
#define EVSYS_INTENSET_EVD0_Pos        8              /**< \brief (EVSYS_INTENSET) Event Detection Interrupt Enable for Channels 0 to 7 (modulo 16) */
#define EVSYS_INTENSET_EVD0_Msk        ( 0xFFu << EVSYS_INTENSET_EVD0_Pos )
#define EVSYS_INTENSET_EVD0( value )    ( ( EVSYS_INTENSET_EVD0_Msk & ( ( value ) << EVSYS_INTENSET_EVD0_Pos ) ) )
#define   EVSYS_INTENSET_EVD0_EVD0     ( 0x1u << 8 )  /**< \brief (EVSYS_INTENSET) Event detected on Channel 0 */
#define   EVSYS_INTENSET_EVD0_EVD1     ( 0x2u << 8 )  /**< \brief (EVSYS_INTENSET) Event detected on Channel 1 */
#define   EVSYS_INTENSET_EVD0_EVD2     ( 0x4u << 8 )  /**< \brief (EVSYS_INTENSET) Event detected on Channel 2 */
#define   EVSYS_INTENSET_EVD0_EVD3     ( 0x8u << 8 )  /**< \brief (EVSYS_INTENSET) Event detected on Channel 3 */
#define   EVSYS_INTENSET_EVD0_EVD4     ( 0x10u << 8 ) /**< \brief (EVSYS_INTENSET) Event detected on Channel 4 */
#define   EVSYS_INTENSET_EVD0_EVD5     ( 0x20u << 8 ) /**< \brief (EVSYS_INTENSET) Event detected on Channel 5 */
#define   EVSYS_INTENSET_EVD0_EVD6     ( 0x40u << 8 ) /**< \brief (EVSYS_INTENSET) Event detected on Channel 6 */
#define   EVSYS_INTENSET_EVD0_EVD7     ( 0x80u << 8 ) /**< \brief (EVSYS_INTENSET) Event detected on Channel 7 */
#define EVSYS_INTENSET_OVR1_Pos        16             /**< \brief (EVSYS_INTENSET) Overrun Interrupt Enable for Channels 8 to 15 (modulo 16) */
#define EVSYS_INTENSET_OVR1_Msk        ( 0xFFu << EVSYS_INTENSET_OVR1_Pos )
#define EVSYS_INTENSET_OVR1( value )    ( ( EVSYS_INTENSET_OVR1_Msk & ( ( value ) << EVSYS_INTENSET_OVR1_Pos ) ) )
#define   EVSYS_INTENSET_OVR1_OVR8     ( 0x1u << 16 )  /**< \brief (EVSYS_INTENSET) Overrun detected on Channel 8 */
#define   EVSYS_INTENSET_OVR1_OVR9     ( 0x2u << 16 )  /**< \brief (EVSYS_INTENSET) Overrun detected on Channel 9 */
#define   EVSYS_INTENSET_OVR1_OVR10    ( 0x4u << 16 )  /**< \brief (EVSYS_INTENSET) Overrun detected on Channel 10 */
#define   EVSYS_INTENSET_OVR1_OVR11    ( 0x8u << 16 )  /**< \brief (EVSYS_INTENSET) Overrun detected on Channel 11 */
#define   EVSYS_INTENSET_OVR1_OVR12    ( 0x10u << 16 ) /**< \brief (EVSYS_INTENSET) Overrun detected on Channel 12 */
#define   EVSYS_INTENSET_OVR1_OVR13    ( 0x20u << 16 ) /**< \brief (EVSYS_INTENSET) Overrun detected on Channel 13 */
#define   EVSYS_INTENSET_OVR1_OVR14    ( 0x40u << 16 ) /**< \brief (EVSYS_INTENSET) Overrun detected on Channel 14 */
#define   EVSYS_INTENSET_OVR1_OVR15    ( 0x80u << 16 ) /**< \brief (EVSYS_INTENSET) Overrun detected on Channel 15 */
#define EVSYS_INTENSET_EVD1_Pos        24              /**< \brief (EVSYS_INTENSET) Event Detection Interrupt Enable for Channels 8 to 15 (modulo 16) */
#define EVSYS_INTENSET_EVD1_Msk        ( 0xFFu << EVSYS_INTENSET_EVD1_Pos )
#define EVSYS_INTENSET_EVD1( value )    ( ( EVSYS_INTENSET_EVD1_Msk & ( ( value ) << EVSYS_INTENSET_EVD1_Pos ) ) )
#define   EVSYS_INTENSET_EVD1_EVD8     ( 0x1u << 24 )  /**< \brief (EVSYS_INTENSET) Event detected on Channel 8 */
#define   EVSYS_INTENSET_EVD1_EVD9     ( 0x2u << 24 )  /**< \brief (EVSYS_INTENSET) Event detected on Channel 9 */
#define   EVSYS_INTENSET_EVD1_EVD10    ( 0x4u << 24 )  /**< \brief (EVSYS_INTENSET) Event detected on Channel 10 */
#define   EVSYS_INTENSET_EVD1_EVD11    ( 0x8u << 24 )  /**< \brief (EVSYS_INTENSET) Event detected on Channel 11 */
#define   EVSYS_INTENSET_EVD1_EVD12    ( 0x10u << 24 ) /**< \brief (EVSYS_INTENSET) Event detected on Channel 12 */
#define   EVSYS_INTENSET_EVD1_EVD13    ( 0x20u << 24 ) /**< \brief (EVSYS_INTENSET) Event detected on Channel 13 */
#define   EVSYS_INTENSET_EVD1_EVD14    ( 0x40u << 24 ) /**< \brief (EVSYS_INTENSET) Event detected on Channel 14 */
#define   EVSYS_INTENSET_EVD1_EVD15    ( 0x80u << 24 ) /**< \brief (EVSYS_INTENSET) Event detected on Channel 15 */
#define EVSYS_INTENSET_MASK            0xFFFFFFFFu     /**< \brief (EVSYS_INTENSET) MASK Register */

/* -------- EVSYS_INTFLAG : (EVSYS Offset: 0x18) (R/W 32) Interrupt Flag Status and Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t OVR0 : 8; /*!< bit:  0.. 7  Overrun Interrupt Flag for Channels 0 to 7 (modulo 16) */
            uint32_t EVD0 : 8; /*!< bit:  8..15  Event Detection Interrupt Flag for Channels 0 to 7 (modulo 16) */
            uint32_t OVR1 : 8; /*!< bit: 16..23  Overrun Interrupt Flag for Channels 8 to 15 (modulo 16) */
            uint32_t EVD1 : 8; /*!< bit: 24..31  Event Detection Interrupt Flag for Channels 8 to 15 (modulo 16) */
        } bit;                 /*!< Structure used for bit  access                  */
        uint32_t reg;          /*!< Type      used for register access              */
    } EVSYS_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define EVSYS_INTFLAG_OFFSET          0x18       /**< \brief (EVSYS_INTFLAG offset) Interrupt Flag Status and Clear Register */
#define EVSYS_INTFLAG_RESETVALUE      0x00000000 /**< \brief (EVSYS_INTFLAG reset_value) Interrupt Flag Status and Clear Register */

#define EVSYS_INTFLAG_OVR0_Pos        0          /**< \brief (EVSYS_INTFLAG) Overrun Interrupt Flag for Channels 0 to 7 (modulo 16) */
#define EVSYS_INTFLAG_OVR0_Msk        ( 0xFFu << EVSYS_INTFLAG_OVR0_Pos )
#define EVSYS_INTFLAG_OVR0( value )    ( ( EVSYS_INTFLAG_OVR0_Msk & ( ( value ) << EVSYS_INTFLAG_OVR0_Pos ) ) )
#define   EVSYS_INTFLAG_OVR0_OVR0     ( 0x1u << 0 )  /**< \brief (EVSYS_INTFLAG) Overrun detected on Channel 0 */
#define   EVSYS_INTFLAG_OVR0_OVR1     ( 0x2u << 0 )  /**< \brief (EVSYS_INTFLAG) Overrun detected on Channel 1 */
#define   EVSYS_INTFLAG_OVR0_OVR2     ( 0x4u << 0 )  /**< \brief (EVSYS_INTFLAG) Overrun detected on Channel 2 */
#define   EVSYS_INTFLAG_OVR0_OVR3     ( 0x8u << 0 )  /**< \brief (EVSYS_INTFLAG) Overrun detected on Channel 3 */
#define   EVSYS_INTFLAG_OVR0_OVR4     ( 0x10u << 0 ) /**< \brief (EVSYS_INTFLAG) Overrun detected on Channel 4 */
#define   EVSYS_INTFLAG_OVR0_OVR5     ( 0x20u << 0 ) /**< \brief (EVSYS_INTFLAG) Overrun detected on Channel 5 */
#define   EVSYS_INTFLAG_OVR0_OVR6     ( 0x40u << 0 ) /**< \brief (EVSYS_INTFLAG) Overrun detected on Channel 6 */
#define   EVSYS_INTFLAG_OVR0_OVR7     ( 0x80u << 0 ) /**< \brief (EVSYS_INTFLAG) Overrun detected on Channel 7 */
#define EVSYS_INTFLAG_EVD0_Pos        8              /**< \brief (EVSYS_INTFLAG) Event Detection Interrupt Flag for Channels 0 to 7 (modulo 16) */
#define EVSYS_INTFLAG_EVD0_Msk        ( 0xFFu << EVSYS_INTFLAG_EVD0_Pos )
#define EVSYS_INTFLAG_EVD0( value )    ( ( EVSYS_INTFLAG_EVD0_Msk & ( ( value ) << EVSYS_INTFLAG_EVD0_Pos ) ) )
#define   EVSYS_INTFLAG_EVD0_EVD0     ( 0x1u << 8 )  /**< \brief (EVSYS_INTFLAG) Event detected on Channel 0 */
#define   EVSYS_INTFLAG_EVD0_EVD1     ( 0x2u << 8 )  /**< \brief (EVSYS_INTFLAG) Event detected on Channel 1 */
#define   EVSYS_INTFLAG_EVD0_EVD2     ( 0x4u << 8 )  /**< \brief (EVSYS_INTFLAG) Event detected on Channel 2 */
#define   EVSYS_INTFLAG_EVD0_EVD3     ( 0x8u << 8 )  /**< \brief (EVSYS_INTFLAG) Event detected on Channel 3 */
#define   EVSYS_INTFLAG_EVD0_EVD4     ( 0x10u << 8 ) /**< \brief (EVSYS_INTFLAG) Event detected on Channel 4 */
#define   EVSYS_INTFLAG_EVD0_EVD5     ( 0x20u << 8 ) /**< \brief (EVSYS_INTFLAG) Event detected on Channel 5 */
#define   EVSYS_INTFLAG_EVD0_EVD6     ( 0x40u << 8 ) /**< \brief (EVSYS_INTFLAG) Event detected on Channel 6 */
#define   EVSYS_INTFLAG_EVD0_EVD7     ( 0x80u << 8 ) /**< \brief (EVSYS_INTFLAG) Event detected on Channel 7 */
#define EVSYS_INTFLAG_OVR1_Pos        16             /**< \brief (EVSYS_INTFLAG) Overrun Interrupt Flag for Channels 8 to 15 (modulo 16) */
#define EVSYS_INTFLAG_OVR1_Msk        ( 0xFFu << EVSYS_INTFLAG_OVR1_Pos )
#define EVSYS_INTFLAG_OVR1( value )    ( ( EVSYS_INTFLAG_OVR1_Msk & ( ( value ) << EVSYS_INTFLAG_OVR1_Pos ) ) )
#define   EVSYS_INTFLAG_OVR1_OVR8     ( 0x1u << 16 )  /**< \brief (EVSYS_INTFLAG) Overrun detected on Channel 8 */
#define   EVSYS_INTFLAG_OVR1_OVR9     ( 0x2u << 16 )  /**< \brief (EVSYS_INTFLAG) Overrun detected on Channel 9 */
#define   EVSYS_INTFLAG_OVR1_OVR10    ( 0x4u << 16 )  /**< \brief (EVSYS_INTFLAG) Overrun detected on Channel 10 */
#define   EVSYS_INTFLAG_OVR1_OVR11    ( 0x8u << 16 )  /**< \brief (EVSYS_INTFLAG) Overrun detected on Channel 11 */
#define   EVSYS_INTFLAG_OVR1_OVR12    ( 0x10u << 16 ) /**< \brief (EVSYS_INTFLAG) Overrun detected on Channel 12 */
#define   EVSYS_INTFLAG_OVR1_OVR13    ( 0x20u << 16 ) /**< \brief (EVSYS_INTFLAG) Overrun detected on Channel 13 */
#define   EVSYS_INTFLAG_OVR1_OVR14    ( 0x40u << 16 ) /**< \brief (EVSYS_INTFLAG) Overrun detected on Channel 14 */
#define   EVSYS_INTFLAG_OVR1_OVR15    ( 0x80u << 16 ) /**< \brief (EVSYS_INTFLAG) Overrun detected on Channel 15 */
#define EVSYS_INTFLAG_EVD1_Pos        24              /**< \brief (EVSYS_INTFLAG) Event Detection Interrupt Flag for Channels 8 to 15 (modulo 16) */
#define EVSYS_INTFLAG_EVD1_Msk        ( 0xFFu << EVSYS_INTFLAG_EVD1_Pos )
#define EVSYS_INTFLAG_EVD1( value )    ( ( EVSYS_INTFLAG_EVD1_Msk & ( ( value ) << EVSYS_INTFLAG_EVD1_Pos ) ) )
#define   EVSYS_INTFLAG_EVD1_EVD8     ( 0x1u << 24 )  /**< \brief (EVSYS_INTFLAG) Event detected on Channel 8 */
#define   EVSYS_INTFLAG_EVD1_EVD9     ( 0x2u << 24 )  /**< \brief (EVSYS_INTFLAG) Event detected on Channel 9 */
#define   EVSYS_INTFLAG_EVD1_EVD10    ( 0x4u << 24 )  /**< \brief (EVSYS_INTFLAG) Event detected on Channel 10 */
#define   EVSYS_INTFLAG_EVD1_EVD11    ( 0x8u << 24 )  /**< \brief (EVSYS_INTFLAG) Event detected on Channel 11 */
#define   EVSYS_INTFLAG_EVD1_EVD12    ( 0x10u << 24 ) /**< \brief (EVSYS_INTFLAG) Event detected on Channel 12 */
#define   EVSYS_INTFLAG_EVD1_EVD13    ( 0x20u << 24 ) /**< \brief (EVSYS_INTFLAG) Event detected on Channel 13 */
#define   EVSYS_INTFLAG_EVD1_EVD14    ( 0x40u << 24 ) /**< \brief (EVSYS_INTFLAG) Event detected on Channel 14 */
#define   EVSYS_INTFLAG_EVD1_EVD15    ( 0x80u << 24 ) /**< \brief (EVSYS_INTFLAG) Event detected on Channel 15 */
#define EVSYS_INTFLAG_MASK            0xFFFFFFFFu     /**< \brief (EVSYS_INTFLAG) MASK Register */

/** \brief EVSYS hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct
    {
        __O EVSYS_CTRL_Type CTRL;             /**< \brief Offset: 0x00 ( /W  8) Control Register */
        RoReg8 Reserved1[ 0x3 ];
        __IO EVSYS_CHANNEL_Type CHANNEL;      /**< \brief Offset: 0x04 (R/W 32) Channel Register */
        __IO EVSYS_USER_Type USER;            /**< \brief Offset: 0x08 (R/W 16) User Mux Register */
        RoReg8 Reserved2[ 0x2 ];
        __I EVSYS_CHSTATUS_Type CHSTATUS;     /**< \brief Offset: 0x0C (R/  32) Channel Status Register */
        __IO EVSYS_INTENCLR_Type INTENCLR;    /**< \brief Offset: 0x10 (R/W 32) Interrupt Enable Clear Register */
        __IO EVSYS_INTENSET_Type INTENSET;    /**< \brief Offset: 0x14 (R/W 32) Interrupt Enable Set Register */
        __IO EVSYS_INTFLAG_Type INTFLAG;      /**< \brief Offset: 0x18 (R/W 32) Interrupt Flag Status and Clear Register */
    } Evsys;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAMD20_EVSYS_COMPONENT_ */
